public class Main {
    public static void main(String[] args) {

        int price = 300;// Объявляете переменные для входных данных и
        int ruble = 5;// параметров программы: одну для хранения
        int bonus = price / ruble;

        System.out.println("Итоговый бонус: " + bonus); // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили
        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
